tenant_template_esbinput/api_deploy/api__deploy__tenant__deleteRole.xml

<@pp.dropOutputFile />
<@pp.changeOutputFile name="api__deploy__"+tenant.code+"__deleteRole.xml"/>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://org.apache.axis2/xsd">
   <soapenv:Header/>
   <soapenv:Body>
      <xsd:deleteRole>
         <xsd:roleName>mb-topic-all-input.${tenant.code}</xsd:roleName>
      </xsd:deleteRole>
   </soapenv:Body>
</soapenv:Envelope>